app/controllers/records_controller.rb

INSERT INTO "records" ("updated_at", "click_date", "working_day_id", "login", "created_at") VALUES('2010-02-05 15:20:54', '2010-02-04 21:00:00', NULL, 'skozlov@enkata.com', '2010-02-05 15:20:54')
---
  def create
    @user = current_user
    @record =  @user.records.build(params[:record])
       if @record.save

SELECT * FROM "working_days" WHERE ("working_days".login = 'skozlov@enkata.com' AND ("working_days"."wday" = '2010-02-06')) LIMIT 1
SELECT * FROM "records" WHERE ("records".login = 'skozlov@enkata.com') ORDER BY working_day_id
SELECT min("records".click_date) AS min_click_date FROM "records" WHERE ("records"."working_day_id" = 2)
---
  def show
    require_user
    @user = current_user

    # No recalculation required - just pass @var with current Duration
    if @working_today = @user.working_days.find(:first, :conditions => {:wday => Time.now.to_date})
         @distance_walked = (Time.now.to_i - @working_day.check_in.to_i).floor/60
    end

    @logged_records =  @user.records.find(:all, :order => 'click_date')