app/controllers/upload_controller.rb

  def table
      processed_days = Array.new

=begin
      Dir.glob(DATA_DIR+"/snapshot*.txt").each do |snp|
      #TODO: Made chomp on the file
       File.open(snp) do |file|
         file.each_line do |line|
            @record = Record.new ( :login => line.split(",")[0], :click_date => line.split(",")[1] )
           processed_days << @record.process if @record.save

         end
      end
        WorkingDay.stat_refresh(processed_days.uniq)
      end
=end
       users,records = ProcessFile.process(DATA_DIR+"/1222-1225-628.csv")
       hrr = users_hierarchy

       users.each do |u|
        puts "Adding #{u[:login]}"

        unless User.find(:first, :conditions => {:login => u[:login]})
---
INSERT INTO "records" ("updated_at", "click_date", "working_day_id", "login", "created_at") VALUES('2010-02-11 16:17:01', '2010-02-11 11:30:00', NULL, 'skozlov@enkata.com', '2010-02-11 16:17:01')
SELECT * FROM "users" WHERE ("users"."login" = 'skozlov@enkata.com') LIMIT 1