app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.login = (params[:user][:email])
    harr = users_hierarchy
    @user[:type], @user[:reports_to] = user_type_manager(@user.login,harr)

      if @user.save
---
INSERT INTO "users" ("updated_at", "crypted_password", "password_salt", "persistence_token", "login", "email", "created_at") VALUES('2010-01-31 11:09:18', 'fb8442af32b664d2898a92d33d56fe26011d57cb15c0f64f7af9b543ea502806b3588936418d7ed687b019947b80afd3a34dbb6aa5f709d947c5dbac8c18b699', 'UOrzWjrZDhm6TwxaUV2s', 'c535ca75acec8d89e4769b54c8e413f5e945ddfe64cab8e651710169924840f46e65ca224ac942faf643b20a128984fdaebab124042cc7a3564328b50fe66ae0', 'skozlov@enkata.com', 'skozlov@enkata.com', '2010-01-31 11:09:18')